:REVEAL_PROPERTIES:
#+REVEAL_ROOT: file:///home/dedenbangkit/.doom.d/custom/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_THEME: akvo
:END:

#+TITLE: Response Group Research
#+Author: Deden Bangkit

#+PROPERTY: header-args:sql     :exports both
#+PROPERTY: header-args:sql+    :engine postgresql
#+PROPERTY: header-args:sql+    :dbhost localhost
#+PROPERTY: header-args:sql+    :dbuser akvo
#+PROPERTY: header-args:sql+    :dbpassword password
#+PROPERTY: header-args:sql+    :database demo
#+PROPERTY: header-args :tangle data-model.sql
#+STARTUP: fold

* Notes
#+name: pd2org
#+begin_src python :var df="df" :exports none
  return f"return tabulate({df}, headers={df}.columns, tablefmt='orgtbl')"
#+end_src

#+name: usage example
#+header: :prologue from tabulate import tabulate
#+header: :noweb strip-export
#+begin_src python :results value raw :exports none
  import pandas as pd
  df = pd.DataFrame([{"a":1} for a in range(2)])
  <<pd2org("df")>>
#+end_src

#+RESULTS:
* Cases
** from [[https://app.excalidraw.com/s/2tVeGVHqKIQ/6Aoixp68qlt][Excalidraw Link]]
** Questions

#+name: WINS QUESTION LIST
#+begin_src sql
  SELECT id, name FROM question
  WHERE id IN (567800083,567800082,567820002,578820191,567800081,567820008)
#+end_src

#+RESULTS: WINS QUESTION LIST
|        id | name                                                                                        |
|-----------+---------------------------------------------------------------------------------------------|
| 567820002 | School type                                                                                 |
| 578820191 | Is this school Girls Only/Boys Only/Co-Education?                                           |
| 567820008 | Are there any students or staff members with a disability?                                  |
| 567800083 | Does your school have toilet for students?                                                  |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) |
| 567800081 | Are the toilets/latrines separate for girls and boys?                                       |

** Option List

#+name: WINS OPTION LIST
#+begin_src sql
  SELECT q.id, q.name as question, q.type, o.name as opt FROM option o
  RIGHT JOIN question q
  ON q.id = o.question
  WHERE q.id IN (567800083,567800082,567820002,578820191,567800081,567800080)
#+end_src

#+RESULTS: WINS OPTION LIST
|        id | question                                                                                    | type   | opt                                                |
|-----------+---------------------------------------------------------------------------------------------+--------+----------------------------------------------------|
| 567820002 | School type                                                                                 | option | Kindergarten/Child Care Centre                     |
| 567820002 | School type                                                                                 | option | Primary                                            |
| 567820002 | School type                                                                                 | option | Secondary                                          |
| 567820002 | School type                                                                                 | option | Higher Secondary/10+2                              |
| 567820002 | School type                                                                                 | option | Other                                              |
| 578820191 | Is this school Girls Only/Boys Only/Co-Education?                                           | option | Girls Only                                         |
| 578820191 | Is this school Girls Only/Boys Only/Co-Education?                                           | option | Boys Only                                          |
| 578820191 | Is this school Girls Only/Boys Only/Co-Education?                                           | option | Co-education                                       |
| 567800083 | Does your school have toilet for students?                                                  | option | Yes                                                |
| 567800083 | Does your school have toilet for students?                                                  | option | No                                                 |
| 567800083 | Does your school have toilet for students?                                                  | option | Underconstruction                                  |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Toilet that flush/poor flush to piped sewer system |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Toilet that flush/poor flush to septic tank        |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Toilet that flush/poor flush to elsewhere          |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Toilet that flush/poor flush but don't know where  |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Pit latrine with slab                              |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Ventilated Improved Pit latrine (VIP)              |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Twinpit offset latrine                             |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Composting toilet                                  |
| 567800082 | What type of student toilets are at the school? (Select the one that is most commonly used) | option | Pit latrine without slab/open pit                  |
| 567800081 | Are the toilets/latrines separate for girls and boys?                                       | option | Yes                                                |
| 567800081 | Are the toilets/latrines separate for girls and boys?                                       | option | No                                                 |
| 567800080 | How many student toilets are currently usable (accessible and functional and private)?      | number |                                                    |

** Sanitation Service Level (Nepal WINS):
#+begin_src python :results output :exports both :session with_question_ids
config = [{
    "name": "Basic",
    "questions": [{
        "id": 567800083,
        "name": "School Has Toilet",
        "options": ["Yes"],
        "other": [{
            "name": "Was Limited",
            "options": ["Underconstruction"],
            "questions": [{
                "id": 999,
                "number": {
                    "greater_than": 0
                },
                "else": {
                    "value": "No Service"
                }
            }]
        }],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 567800082,
        "name": "Toilet Type",
        "options": [
            "Toilet that flush/poor flush to piped sewer system",
            "Toilet that flush/poor flush to septic tank",
            "Toilet that flush/poor flush to elsewhere",
            "Toilet that flush/poor flush but don't know where",
            "Pit latrine with slab",
            "Ventilated Improved Pit latrine (VIP)",
            "Twinpit offset latrine"
        ],
        "else": {
            "value": "Limited"
        }
    },{
        "id":567820002,
        "name": "School Type",
        "options": ["Primary", "Kindergarten/Child Care Centre"],
        "else": {
            "ignore": [578820191,567800081]
        }
    },{
        "id": 578820191,
        "name": "Is the school co-ed",
        "options": ["Co-education"],
        "else": {
            "ignore": [567800081]
        }
    },{
        "id": 567800081,
        "name": "Saperate Toilet",
        "options": ["Yes"],
        "else": {
            "value": "Limited"
        }
    },{
        "id": 567800080,
        "name": "Usable Toilet",
        "number": {
            "greater_than": 3
        },
        "else": {
            "value": "Limited"
        }
    }]
}]
#+end_src
** Water Services Level (Nepal Household):
#+begin_src python :results output :exports both :session with_question_ids
config = [{
    "name": "Safely Managed",
    "questions": [{
        "id": 573340127,
        "name": "Main Source",
        "options": [
            "Protected dug well",
            "Public tap/standpipe",
            "Piped water into dwelling (household connection)",
            "Piped to neighbour",
            "Piped water to yard/plot",
            "Shared Deep tube well / shallow tube well",
            "Shallow tubewell/borehole",
            "Protected spring",
            "Deep tubewell/borehole"
        ],
        "other": [{
            "name": "Surface Water",
            "options": ["Surface water"],
            "questions": []
        }],
        "else": {
            "value": "Unimproved"
        }
    },{
        "id": 573340128,
        "name": "How long is the distance",
        "options": [
            "Less than 30 minutes",
            "Don't know"
        ],
        "else": {
            "value": "Limited"
        }
    },{
        "id":573340129,
        "name": "Sufficient Quantities",
        "options": ["No, always sufficient"],
        "else": {
            "value": "Basic"
        }
    },{
        "id": 573340125,
        "name": "Drinking water quality",
        "options": ["Free from feacal and prioirty chemical contamination"],
        "else": {
            "value": "Basic"
        }
    }]
}]
print(config)
#+end_src

#+RESULTS:
: [{'name': 'Safely Managed', 'questions': [{'id': 573340127, 'name': 'Main Source', 'options': ['Protected dug well', 'Public tap/standpipe', 'Piped water into dwelling (household connection)', 'Piped to neighbour', 'Piped water to yard/plot', 'Shared Deep tube well / shallow tube well', 'Shallow tubewell/borehole', 'Protected spring', 'Deep tubewell/borehole'], 'other': [{'name': 'Surface Water', 'options': ['Surface water'], 'questions': []}], 'else': {'value': 'Unimproved'}}, {'id': 573340128, 'name': 'How long is the distance', 'options': ['Less than 30 minutes', "Don't know"], 'else': {'value': 'Limited'}}, {'id': 573340129, 'name': 'Sufficient Quantities', 'options': ['No, always sufficient'], 'else': {'value': 'Basic'}}, {'id': 573340125, 'name': 'Drinking water quality', 'options': ['Free from feacal and prioirty chemical contamination'], 'else': {'value': 'Basic'}}]}]

** Health Facilities Level (Ethiopia Household):
#+begin_src python :results output :exports both :session with_question_ids
config = [{
    "name": "Basic",
    "questions": [{
        "id": 559830324,
        "name": "Type of Toilet",
        "options": [
            "Flush / Pour-flush toilet to sewer connection",
            "Flush / Pour-flush toilet to tank or pit",
            "Pit latrine with slab",
            "Composting toilet",
        ],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 559830321,
        "name": "At Least 1",
        "options": [
            "Yes"
        ],
        "other": [{
            "name": "Limited",
            "options": ["No"],
            "questions": []
        }],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 559830322,
        "name": "Staff Dedicated",
        "options": [
            "Yes"
        ],
        "other": [{
            "name": "Limited",
            "options": ["No"],
            "questions": []
        }],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 559830320,
        "name": "Sex Separated",
        "options": [
            "Yes"
        ],
        "other": [{
            "name": "Limited",
            "options": ["No"],
            "questions": []
        }],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 559830319,
        "name": "Accessible for Limited Mobility",
        "options": [
            "Yes"
        ],
        "other": [{
            "name": "Limited",
            "options": ["No"],
            "questions": []
        }],
        "else": {
            "value": "No Service"
        }
    },{
        "id": 559830323,
        "name": "General Condition",
        "options": [
            "Clean"
        ],
        "other": [{
            "name": "Limited",
            "options": ["Dirty but being used"],
            "questions": []
        }],
        "else": {
            "value": "No Service"
        }
    }]
}]
print(config)
#+end_src

#+RESULTS:
: [{'name': 'Basic', 'questions': [{'id': 559830324, 'name': 'Type of Toilet', 'options': ['Flush / Pour-flush toilet to sewer connection', 'Flush / Pour-flush toilet to tank or pit', 'Pit latrine with slab', 'Composting toilet'], 'else': {'value': 'No Service'}}, {'id': 559830321, 'name': 'At Least 1', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830322, 'name': 'Staff Dedicated', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830320, 'name': 'Sex Separated', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830319, 'name': 'Accessible for Limited Mobility', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830323, 'name': 'General Condition', 'options': ['Clean'], 'other': [{'name': 'Limited', 'options': ['Dirty but being used'], 'questions': []}], 'else': {'value': 'No Service'}}]}]

* Queries
** Environment

#+begin_src python :results output :exports both :session with_question_ids
import psycopg2
import pandas as pd
import itertools as it
from tabulate import tabulate
from sqlalchemy import create_engine
def get_question_config(n, current_list):
    for q in n.get("questions"):
        current_list.append(str(q["id"]))
        if q.get("other"):
            for o in q.get("other"):
                current_list = get_question_config(o, current_list)
    return current_list

question_config = []
for c in config:
    question_config = get_question_config(c, question_config)

question_lists = ",".join(question_config)

DATABASE_URL='postgresql+psycopg2://akvo:password@127.0.0.1/demo'
engine = create_engine(DATABASE_URL, pool_recycle=3600)
db = engine.connect()
print("SESSION CREATED")
#+end_src

#+RESULTS:
: SESSION CREATED

#+name: Config
#+begin_src python :results output :exports both :session with_question_ids
print(question_lists)
print(config)
#+end_src

#+RESULTS: Config
: 559830324,559830321,559830322,559830320,559830319,559830323
: [{'name': 'Basic', 'questions': [{'id': 559830324, 'name': 'Type of Toilet', 'options': ['Flush / Pour-flush toilet to sewer connection', 'Flush / Pour-flush toilet to tank or pit', 'Pit latrine with slab', 'Composting toilet'], 'else': {'value': 'No Service'}}, {'id': 559830321, 'name': 'At Least 1', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830322, 'name': 'Staff Dedicated', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830320, 'name': 'Sex Separated', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830319, 'name': 'Accessible for Limited Mobility', 'options': ['Yes'], 'other': [{'name': 'Limited', 'options': ['No'], 'questions': []}], 'else': {'value': 'No Service'}}, {'id': 559830323, 'name': 'General Condition', 'options': ['Clean'], 'other': [{'name': 'Limited', 'options': ['Dirty but being used'], 'questions': []}], 'else': {'value': 'No Service'}}]}]

** Probability

#+RESULTS:

#+name: Probability
#+begin_src python :results value raw :exports both :session with_question_ids
query = f"""
        SELECT q.id, concat(q.id,'|',o.name) as options FROM option o
        LEFT JOIN question q
        ON o.question = q.id
        WHERE q.id IN ({question_lists})
        """
df = pd.read_sql(query, db);
unique_id = df["id"].unique()
answers = []
for u in unique_id:
    group = list(df[df.id == u]["options"])
    answers.append(group)
res = []
for answer in list(it.product(*answers)):
    dict_answer = {}
    for a in answer:
        q = a.split('|')
        dict_answer.update({q[0]: q[1]})
    res.append(dict_answer)
res = pd.DataFrame(res)
#tabulate(res, headers=res.columns, tablefmt='orgtbl')
res.shape
#+end_src

#+RESULTS: Probability
(810, 5)

** Materialized Views

#+NAME: BASIC DATA
#+begin_src sql
SELECT q.form, a.data, jsonb_object_agg(a.question, COALESCE(a.options, array[a.value::text])) as opt
FROM answer a
LEFT JOIN question q ON q.id = a.question
WHERE (a.value IS NOT NULL OR a.options IS NOT NULL)
AND q.id IN (567800083,567800082,567820002,578820191,567800081,567800080,999)
GROUP BY q.form, a.data
#+end_src

#+RESULTS: BASIC DATA
|      form | data | opt                                                                                                                                                                                                                   |
|-----------+------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 554360198 |   81 | {"567800083": ["Underconstruction"], "567820002": ["Secondary"], "578820191": ["Girls Only"]}                                                                                                                         |
| 554360198 |   69 | {"567800080": ["1"], "567800081": ["No"], "567800082": ["Pit latrine without slab/open pit"], "567800083": ["Yes"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Co-education"]}                   |
| 554360198 |   68 | {"567800080": ["3"], "567800081": ["No"], "567800082": ["Twinpit offset latrine"], "567800083": ["Yes"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Co-education"]}                                       |
| 554360198 |   59 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Co-education"]}                                                                                                                                          |
| 554360198 |   58 | {"567800080": ["1"], "567800082": ["Ventilated Improved Pit latrine (VIP)"], "567800083": ["Yes"], "567820002": ["Secondary"], "578820191": ["Boys Only"]}                                                            |
| 554360198 |   87 | {"567800080": ["3"], "567800082": ["Toilet that flush/poor flush to piped sewer system"], "567800083": ["Yes"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                   |
| 554360198 |   76 | {"999": ["2"], "567800083": ["Underconstruction"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                                                                                |
| 554360198 |   53 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Girls Only"]}                                                                                                                                        |
| 554360198 |   56 | {"567800080": ["3"], "567800082": ["Pit latrine without slab/open pit"], "567800083": ["Yes"], "567820002": ["Primary"], "578820191": ["Girls Only"]}                                                                 |
| 554360198 |   95 | {"567800080": ["3"], "567800082": ["Toilet that flush/poor flush but don't know where"], "567800083": ["Yes"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Girls Only"]}                          |
| 554360198 |   92 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Girls Only"]}                                                                                                                                            |
| 554360198 |   94 | {"567800083": ["No"], "567820002": ["Primary"], "578820191": ["Co-education"]}                                                                                                                                        |
| 554360198 |   89 | {"999": ["3"], "567800083": ["Underconstruction"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Co-education"]}                                                                                             |
| 554360198 |   62 | {"999": ["1"], "567800083": ["Underconstruction"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Boys Only"]}                                                                                       |
| 554360198 |   96 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Girls Only"]}                                                                                                                                            |
| 554360198 |   65 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Co-education"]}                                                                                                                                          |
| 554360198 |   79 | {"567800083": ["No"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Co-education"]}                                                                                                                 |
| 554360198 |   54 | {"567800083": ["No"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Co-education"]}                                                                                                                          |
| 554360198 |   77 | {"567800080": ["3"], "567800082": ["Composting toilet"], "567800083": ["Yes"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                                                    |
| 554360198 |   83 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Girls Only"]}                                                                                                                                        |
| 554360198 |   63 | {"567800080": ["2"], "567800081": ["Yes"], "567800082": ["Toilet that flush/poor flush to piped sewer system"], "567800083": ["Yes"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Co-education"]} |
| 554360198 |   67 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Boys Only"]}                                                                                                                                         |
| 554360198 |   73 | {"999": ["1"], "567800083": ["Underconstruction"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Boys Only"]}                                                                                       |
| 554360198 |   66 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Boys Only"]}                                                                                                                                             |
| 554360198 |   86 | {"567800083": ["No"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Girls Only"]}                                                                                                                            |
| 554360198 |   88 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Girls Only"]}                                                                                                                                            |
| 554360198 |   60 | {"567800080": ["5"], "567800082": ["Pit latrine with slab"], "567800083": ["Yes"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                                                |
| 554360198 |   84 | {"567800080": ["5"], "567800081": ["Yes"], "567800082": ["Twinpit offset latrine"], "567800083": ["Yes"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Co-education"]}                                      |
| 554360198 |   70 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Girls Only"]}                                                                                                                                        |
| 554360198 |   50 | {"567800080": ["1"], "567800082": ["Composting toilet"], "567800083": ["Yes"], "567820002": ["Primary"], "578820191": ["Girls Only"]}                                                                                 |
| 554360198 |   52 | {"567800083": ["No"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Boys Only"]}                                                                                                                    |
| 554360198 |   78 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Co-education"]}                                                                                                                                      |
| 554360198 |   55 | {"567800080": ["3"], "567800082": ["Pit latrine with slab"], "567800083": ["Yes"], "567820002": ["Other"], "578820191": ["Boys Only"]}                                                                                |
| 554360198 |   61 | {"999": ["3"], "567800083": ["Underconstruction"], "567820002": ["Secondary"], "578820191": ["Co-education"]}                                                                                                         |
| 554360198 |   93 | {"567800080": ["1"], "567800082": ["Toilet that flush/poor flush to elsewhere"], "567800083": ["Yes"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Girls Only"]}                                  |
| 554360198 |   71 | {"567800083": ["No"], "567820002": ["Primary"], "578820191": ["Girls Only"]}                                                                                                                                          |
| 554360198 |   85 | {"567800083": ["No"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                                                                                                             |
| 554360198 |   80 | {"999": ["3"], "567800083": ["Underconstruction"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Girls Only"]}                                                                                      |
| 554360198 |   91 | {"567800083": ["Underconstruction"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Boys Only"]}                                                                                                              |
| 554360198 |   82 | {"999": ["4"], "567800083": ["Underconstruction"], "567820002": ["Primary"], "578820191": ["Boys Only"]}                                                                                                              |
| 554360198 |   72 | {"567800083": ["No"], "567820002": ["Secondary"], "578820191": ["Boys Only"]}                                                                                                                                         |
| 554360198 |   64 | {"999": ["2"], "567800083": ["Underconstruction"], "567820002": ["Higher Secondary/10+2"], "578820191": ["Girls Only"]}                                                                                               |
| 554360198 |   98 | {"999": ["2"], "567800083": ["Underconstruction"], "567820002": ["Kindergarten/Child Care Centre"], "578820191": ["Girls Only"]}                                                                                      |
| 554360198 |   51 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Girls Only"]}                                                                                                                                            |
| 554360198 |   75 | {"567800080": ["1"], "567800082": ["Composting toilet"], "567800083": ["Yes"], "567820002": ["Other"], "578820191": ["Girls Only"]}                                                                                   |
| 554360198 |   97 | {"567800083": ["No"], "567820002": ["Other"], "578820191": ["Boys Only"]}                                                                                                                                             |
| 554360198 |   57 | {"567800080": ["4"], "567800081": ["No"], "567800082": ["Toilet that flush/poor flush to septic tank"], "567800083": ["Yes"], "567820002": ["Primary"], "578820191": ["Co-education"]}                                |
| 554360198 |   90 | {"567800083": ["Underconstruction"], "567820002": ["Primary"], "578820191": ["Co-education"]}                                                                                                                         |
| 554360198 |   74 | {"999": ["4"], "567800083": ["Underconstruction"], "567820002": ["Secondary"], "578820191": ["Boys Only"]}                                                                                                            |

** Data Query

#+name: CHAIN RG
#+begin_src python :results output :exports both :session with_question_ids
query = f"""
    SELECT q.form, a.data, jsonb_object_agg(a.question, COALESCE(a.options, array[a.value::text])) as opt
    FROM answer a
    LEFT JOIN question q ON q.id = a.question
    WHERE (a.value IS NOT NULL OR a.options IS NOT NULL)
    AND a.question IN ({question_lists})
    GROUP BY q.form, a.data
"""
df = pd.read_sql(query, db);
# db.connection.close()

def validate_number(q, answer):
    aw = float(answer[0])
    op = q.get("number")
    ok = False
    if "greater_than" in op:
        ok = aw > op.get("greater_than")
    if "less_than" in op:
        ok = aw < op.get("less_than")
    if "equal" in op:
        ok = aw == op.get("equal")
    if "greater_than_equal" in op:
        ok = aw >= op.get("greater_than_equal")
    if "less_than_equal" in op:
        ok = aw <= op.get("less_than_equal")
    return ok

def get_valid_list(opt, c, category):
    validator = [q["id"] for q in  c['questions']]
    valid = []
    exit = False
    for q in c['questions']:
        if exit:
            continue
        answer = opt.get(str(q['id']))
        if not answer:
            opt.update({str(q['id']): None})
            continue
        if q.get("number"):
            is_valid = validate_number(q, answer)
            if is_valid:
                valid.append(q["id"])
            else:
                elses = q.get("else")
                category = elses.get("value")
                exit = True
        if q.get("options"):
            if len(set(q['options']).intersection(answer)):
                valid.append(q["id"])
            ## TODO Merge else with above
            else:
                if q.get("else"):
                    elses = q.get("else")
                    if elses.get("value"):
                        category = elses.get("value")
                        exit = True
                    if elses.get("ignore"):
                        validator = list(filter(lambda x: x not in elses.get("ignore"), validator))
                        valid.append(q["id"])
                if q.get("other"):
                    for o in q.get("other"):
                        if len(set(o['options']).intersection(answer)):
                            exit = True
                            if len(o.get("questions")):
                                category = get_valid_list(opt, o, category)
                            else:
                                category = o.get("name")
    if len(valid) > len(validator):
        conditions = [v if v in valid else False for v in validator]
        conditions = list(filter(lambda x: x != False, conditions))
        if sorted(conditions) == sorted(validator):
            category = c['name']
    if sorted(valid) == sorted(validator):
        category = c['name']
    return category

def get_category(opt):
    category = False
    for c in config:
        category = get_valid_list(opt, c, category)
    return category

results = df.to_dict('records')
for d in results:
    d.update({'category': get_category(d['opt'])})
res = pd.DataFrame(results)
res = pd.concat([res.drop('opt', axis=1), pd.DataFrame(df['opt'].tolist())], axis=1)
# res = res[[
#     "data",
#     "category",
#     "567800083",
#     "567800082",
#     "578820191",
#     "567820002",
#     "567800081",
#     "567800080",
#     "999"]]
# res = res.rename(columns={
#     "567820002": "Scholl Type",
#     "578820191": "Co-ed",
#     "567800080": "Usable Toilets",
#     "999": "Usable Toilets Before",
#     "567800081": "Separate Toilets",
#     "567800083": "Has Toilet",
#     "567800082": "Toilet Improved",
# })
# res = res[[
#     "data",
#     "category",
#     "573340127",
#     "573340128",
#     "573340129",
#     "573340125",
#
# ]]
# res = res.rename(columns={
#     "573340127": "Main Source",
#     "573340128": "How Long",
#     "573340129": "Sufficient Quantities",
#     "573340125": "Drinking Water Quality",
# })
res = res[[
    "data",
    "category",
    "559830324",
    "559830321",
    "559830320",
    "559830319",
    "559830319",
    "559830323",

]]
res = res.rename(columns={
    "559830324":"Type",
    "559830321":"At least one",
    "559830320":"Staff dedicated",
    "559830319":"Sex Separated",
    "559830319":"Limited Mobility",
    "559830323":"Condition",
})
res.to_csv('./research.csv',index=None)
tabulate(res, headers=res.columns, tablefmt='orgtbl')
db.close()
# Debug
print("SUCCESS")
#qname = pd.read_sql("SELECT name FROM question WHERE question = 567820002", db)
#qname
#+end_src

#+RESULTS: CHAIN RG
: SUCCESS

* Todo
** Numbers Handler
**** Math function form multiple number type of question
**** If calculated number is NaN return 0
**** Implementation Plan.
